/*已知元素从小到大排序的数组
int a[ 11 ] = {2,10,16,251,300,316,6210,8786,8888,10080,0};
从键盘输入一个整数，插入数组a，输出更新后的数组a的元素
输入格式为
2831
输出格式为
2,10,16,251,300,316,2831,6210,8786,8888,10080
*/
#include <stdio.h>
 
int main()
{
    int a[11] = {2, 10, 16, 251, 300, 316, 6210, 8786, 8888, 10080, 0}, t, i;
    scanf("%d", &t);
    for (i = 9; i >= 0;i--)
    {
        if(t>=a[i])
        {
            a[i + 1] = t;
            break;
        }
        a[i + 1] = a[i];
    }
    if(t<a[0])
        a[0] = t;
    printf("%d", a[0]);
    for (i = 1; i < 11;i++)
    {
        printf(",%d", a[i]);
    }
    return 0;
}